'use strict'

/*
================================ Data Types: String | Тип данных: строка

Что такое строка?
    Это значение, которое заключено в кавычки (может быть пустым).

Что такое экранирование? Для чего оно нужно?    
    Экранирование в строке требуется для отображения символа, который может интерпретироваться не корректно.
    Пример:
    `it`s my life` - перед s экранированная кавычка
    `\u1552` - экранированние сообщает о unicode символе

Какие методы со строками вы знаете?
    'a' + 'b' ---> 'ab' - конкатенация строк
    'a'.concat('b') ---> конкатенация строк

    .charAt(2) - по индексу
    .charCodeAt(0) - unicode символа по индексу
    .indexOf('a') - указать индекс сивола в строке

    .split('разделитель') - разбить строку по разделителю 
    
    
*/


